[
{"job_title": "Python Developer - 100 Work from home", "company_name": "hireful", "apply_link": "https://uk.linkedin.com/jobs/view/python-developer-100-work-from-home-at-hireful-4157388373?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "google_job_link": "https://www.google.com/search?sca_esv=fd9ecb9fe59b5df1&q=%22Python+Developer%22,+%22Django%22,+%22Remote%22,+%22London%22&udm=8&fbs=ABzOT_CWdhQLP1FcmU5B0fn3xuWpUUqWdTgXKUjCV_Ho6Bxst7TRVjZxLUd87vODDaDVhDCYCR0SnLvXXI8V0hOz0l1rKUo23MauOhfphhAu9WOcoLOAhQTw4PG1jBzR635n3Nw8uTjYxZIPr3vNaTrEkN5ITiNQk-WMbwda7ssiXx8Q8Cvi3lFVTMtDbY49EpXUpz5l178S&sa=X&ved=2ahUKEwjMs8-30c2LAxUnQvEDHSUFDOcQs6gLegQIHRAB&biw=1534&bih=781&jbr=sep:0#vhid=vt%3D20/docid%3Dj226ArOT8YVPyAIvAAAAAA%3D%3D&vssid=jobs-detail-viewer", "job_description": "Job description\nAre you a Python Software Engineer, keen to join a company who are leading the way in developing and supplying cutting edge web applications for the education industry?Are you keen to work from home five days a week? As a Senior Python Developer, you will be building and maintaining web-based software products that will be used by schools across the UK, to enhance the learning experience kids are ..."},
{"job_title": "part-time Python developer | Side-job", "company_name": "Ubego - quests in real life", "apply_link": "https://wellfound.com/jobs/3218503-part-time-python-developer-side-job?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "google_job_link": "https://www.google.com/search?sca_esv=fd9ecb9fe59b5df1&q=%22Python+Developer%22,+%22Django%22,+%22Remote%22,+%22London%22&udm=8&fbs=ABzOT_CWdhQLP1FcmU5B0fn3xuWpUUqWdTgXKUjCV_Ho6Bxst7TRVjZxLUd87vODDaDVhDCYCR0SnLvXXI8V0hOz0l1rKUo23MauOhfphhAu9WOcoLOAhQTw4PG1jBzR635n3Nw8uTjYxZIPr3vNaTrEkN5ITiNQk-WMbwda7ssiXx8Q8Cvi3lFVTMtDbY49EpXUpz5l178S&sa=X&ved=2ahUKEwjMs8-30c2LAxUnQvEDHSUFDOcQs6gLegQIHRAB&biw=1534&bih=781&jbr=sep:0#vhid=vt%3D20/docid%3D9EPmyvjwtte5jRtXAAAAAA%3D%3D&vssid=jobs-detail-viewer", "job_description": "Job descriptionAre you a Python Software Engineer, keen to join a company who are leading the way in developing and supplying cutting edge web applications for the education industry?Are you keen to work from home five days a week? As a Senior Python Developer, you will be building and maintaining web-based software products that will be used by schools across the UK, to enhance the learning experience kids are ...provided in todays era. We are looking for an experienced Python Coder, preferably with full stack capabilities across technologies such as Django and Vue, although the latter is not essential. This is a great opportunity to make your mark on the quality of education kids receive today…Role: Python Developer aka Python Software Engineer, Python Programmer, Senior Python Developer, Software DeveloperLocation:100% work from home – occasional office visits in Buckinghamshire.Salary:£40k - £50k salary DOE plus great benefitsWhat You Will Bring To The TableYou will be an experienced Python Developer with the skills and capabilities allowing you to work closely with the Head of Engineering, while taking the lead and autonomy on some pretty exciting innovative applications. You will have experience working as a Python Developer, preferably bringing experience of Django and Vue for visual data UI applications. Experience of Python Flask, PHP Laravel would be a bonus, but are non-essential skills as we have a team of PHP Developers. You will work on a variety of systems at any one time giving you great variety in the role.If you like what you hear, please CLICK APPLY and send in a copy of your CV for immediate consideration."},
{"job_title": "[Hiring] Backend/Full-stack Python Developer (Odoo) @YouNav", "company_name": "YouNav", "apply_link": "https://remotive.com/remote-jobs/software-dev/backend-full-stack-python-developer-odoo-1971901?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "google_job_link": "https://www.google.com/search?sca_esv=fd9ecb9fe59b5df1&q=%22Python+Developer%22,+%22Django%22,+%22Remote%22,+%22London%22&udm=8&fbs=ABzOT_CWdhQLP1FcmU5B0fn3xuWpUUqWdTgXKUjCV_Ho6Bxst7TRVjZxLUd87vODDaDVhDCYCR0SnLvXXI8V0hOz0l1rKUo23MauOhfphhAu9WOcoLOAhQTw4PG1jBzR635n3Nw8uTjYxZIPr3vNaTrEkN5ITiNQk-WMbwda7ssiXx8Q8Cvi3lFVTMtDbY49EpXUpz5l178S&sa=X&ved=2ahUKEwjMs8-30c2LAxUnQvEDHSUFDOcQs6gLegQIHRAB&biw=1534&bih=781&jbr=sep:0#vhid=vt%3D20/docid%3DwNKPgHAkqycV4dRjAAAAAA%3D%3D&vssid=jobs-detail-viewer", "job_description": "Job highlightsIdentified by Google from the original job postQualificationsSQL / NoSQLPythonSoftware Architecture design knowledgeBPMNStatistical analysis and computingProbability and StatisticsData VisualizationCamunda / SpiffworkflowSnscrape: A powerful library for scraping social media platforms like Facebook, Twitter, and InstagramChatterBot: A library for developing chatbots with machine learning capabilitiesNLTK (Natural Language Toolkit): For natural language processing tasks in chatbot developmentspaCy: An advanced NLP library for more complex linguistic analysisFastAPI: A modern, high-performance web framework for building APIsDjango REST framework: A powerful toolkit for building RESTful APIs within Django projectsTornado: An asynchronous networking library and web framework for high-performance applications5Beautiful Soup or Scrapy: For web scraping tasks, if Snscrape doesn't cover all required functionality4Pandas: For data manipulation and analysis, especially useful when processing scraped dataHighly disciplinedUsing task management toolsAmbitiousReady to work hard to earn billionsYou can mix easily with your office job19 more items(s)BenefitsWe work for 6 yearsWe have huge repeat purchase rate of 15%+We earn money and growMachine Learning & Deep Learningunit economics indicatorsThis is an equity based compensation opportunityWorkload amount is 10+ hours weekly4 more items(s)ResponsibilitiesWe work with use of scrum methodologyThere are 1 weeks sprints followed by discussing and planningDevelop tools for parsing social networks to find a target audience and interact with these audienceDevelop integration tools to automate orders processing from external websites such as Airbnb and similarDevelop integration tools to automate posting and updating products on external websitesAutomate internet advertisement generation and managementDevelop chat bots to process clients inquires with integration with ChatwootAutomate different business processes with SpiffworkflowCreate automated testsAnalyze datagit / code review (GitLab)LinuxSelenium: For web automation tasks, particularly useful for interacting with dynamic websitesRequests: Essential for making HTTP requests to interact with APIsFlask or Django: Web frameworks for creating webhooks and integrating chatbotspytest or unittest: For creating automated testsTolerant to writing documentation14 more items(s)More job highlightsJob descriptionPart-time/side-jobUbego is a global platform where authors create excursions, quests, and real-life games in the editor. Consumers can purchase and participate in these excursions and games using the mobile app.Ubego currently operates in over 60 cities and is expanding globally. Our plans include offering augmented reality (AR) functions to both authors and customers. Ubego's ultimate goal is... to have millions of quests available, allowing customers to participate in these games every weekend in numerous locations worldwide.We believe that Ubego will revolutionize the world by automating excursions. People will use their smartphones for excursions as autopilot technology will eventually replace human drivers. Providing a cheaper, better, and more independent service will always be a winning strategy.Benefits• We work for 6 years• We have huge repeat purchase rate of 15%+• We earn money and grow• We have worldwide scalable business model• We are team of experienced and obsessive people• We have great company culture and ambitious goalHow do we work?We work with use of scrum methodology. There are 1 weeks sprints followed by discussing and planning. We are following Lean startup methodology where we actively test ideas.Responsibilities• Develop tools for parsing social networks to find a target audience and interact with these audience• Develop integration tools to automate orders processing from external websites such as Airbnb and similar• Develop integration tools to automate posting and updating products on external websites• Automate internet advertisement generation and management• Develop chat bots to process clients inquires with integration with Chatwoot• Automate different business processes with Spiffworkflow• Create automated tests• Analyze dataRequirementsSkills requirementsDatabases:• SQL / NoSQLLanguages:• PythonTools:• git / code review (GitLab)• Linux• Selenium: For web automation tasks, particularly useful for interacting with dynamic websites.• Requests: Essential for making HTTP requests to interact with APIs.• Flask or Django: Web frameworks for creating webhooks and integrating chatbots.• pytest or unittest: For creating automated tests.Other skills:• Software Architecture design knowledge• BPMNNice to know:• Statistical analysis and computing• Probability and Statistics• Machine Learning & Deep Learning• TensorFlow/PyTorch/Sklearn/OpenCV/sk-Image• Selenium / PyAutoGUI• Processing large data sets• Data Visualization• Data Wrangling• Internet advertisement• unit economics indicators• business analytics• C++/Qt/WebAssembly• PyQt• docker/ k8s• product management• Camunda / Spiffworkflow• Snscrape: A powerful library for scraping social media platforms like Facebook, Twitter, and Instagram.• ChatterBot: A library for developing chatbots with machine learning capabilities.• NLTK (Natural Language Toolkit): For natural language processing tasks in chatbot development.• spaCy: An advanced NLP library for more complex linguistic analysis.• FastAPI: A modern, high-performance web framework for building APIs.• Django REST framework: A powerful toolkit for building RESTful APIs within Django projects.• Tornado: An asynchronous networking library and web framework for high-performance applications5.• Beautiful Soup or Scrapy: For web scraping tasks, if Snscrape doesn't cover all required functionality4.• Pandas: For data manipulation and analysis, especially useful when processing scraped data.• ChatwootPersonality requirements• Highly disciplined. Using task management tools• Tolerant to writing documentation• Ambitious. Ready to work hard to earn billionsWhat do we offer?This is an equity based compensation opportunity. To apply, you need to have a full-time job.We offer an option• Up to 1 500 000 shares of Ubego (at the moment there are 11 500 000 shares). P shares hourly + dividends.• Workload amount is 10+ hours weekly. You can mix easily with your office job.We are currently raising investments, and an independent investment manager has estimated the current company valuation at $6,000,000. As a result, gaining access to the team may be challenging, but we encourage you to still give it a try!"},
{"job_title": "Python / Django Developer - Remote", "company_name": "IT Talent Solutions", "apply_link": "https://www.it-jobs.co.uk/job/223063643/Python-Django-Developer-Remote?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "google_job_link": "https://www.google.com/search?sca_esv=fd9ecb9fe59b5df1&q=%22Python+Developer%22,+%22Django%22,+%22Remote%22,+%22London%22&udm=8&fbs=ABzOT_CWdhQLP1FcmU5B0fn3xuWpUUqWdTgXKUjCV_Ho6Bxst7TRVjZxLUd87vODDaDVhDCYCR0SnLvXXI8V0hOz0l1rKUo23MauOhfphhAu9WOcoLOAhQTw4PG1jBzR635n3Nw8uTjYxZIPr3vNaTrEkN5ITiNQk-WMbwda7ssiXx8Q8Cvi3lFVTMtDbY49EpXUpz5l178S&sa=X&ved=2ahUKEwjMs8-30c2LAxUnQvEDHSUFDOcQs6gLegQIHRAB&biw=1534&bih=781&jbr=sep:0#vhid=vt%3D20/docid%3DLYo7OrBjY4YM0RfJAAAAAA%3D%3D&vssid=jobs-detail-viewer", "job_description": "Job descriptionFeb 12, 2025 - YouNav is hiring a remote Backend/Full-stack Python Developer (Odoo) . 💸 Salary: €65k - €75k. 📍Location: Europe.Remote policy: Fully remoteRemote location: EuropeCompany: YouNavSalary: 65-75k EUR (gross employer cost)Type of Employment:• Full-time (CET hours)• Long term• Contractor (or Full-time employee in France only)About YouNavYouNav is the most advanced Marin...a Management System (MMS) on the market, managing 10,000+ berths and boaters, with 100+ marina staff users. Our software boosts boater satisfaction, streamlines marina operations, and frees up staff from repetitive tasks (younav.com).We’ve spent the past seven years creating a tailor-made solution for our first clients—making it profitable and stable without relying on external funding.Now, we’re on an exciting journey to transform our specialized solution into a scalable SaaS product used by marinas worldwide.We’re a close-knit team of 8–10 people headquartered in Paris, France, and we operate fully remote across Europe. Join us and help shape the future of marina management!Why Join Us?• High Impact: Be part of a small tech team (CTO + 2 Devs) where your contributions directly shape the product and the user experience.• Remote-First: Work fully remote from anywhere in Europe—no office commute, just results.• Growth: We’re transitioning from a tailor-made tool to a commercial SaaS, giving you room to innovate and make your mark.• Ownership & Autonomy: We minimize meetings and trust each other’s expertise. You’ll have freedom to devise solutions that solve real business challenges.What You’ll Do• Develop and maintain features within our Python-based stack, leveraging Odoo framework to build and maintain custom modules on top of native modules.• Collaborate in a Kanban workflow via GitLab, picking up roadmap tasks from epics and handling weekly maintenance tasks.• Write efficient, clean, and reusable code for both backend (primarily) and frontend needs.• Work closely with the CTO and teammates on solution design, ensuring features meet business and user requirements.• Contribute to continuous improvement of our codebase, CI/CD pipelines, and overall team processes.About the Tech Stack• Odoo Framework - Python back-end• P"},
{"job_title": "Contract Python Developer", "company_name": "trg.recruitment", "apply_link": "https://uk.linkedin.com/jobs/view/contract-python-developer-at-trg-recruitment-4149477491?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "google_job_link": "https://www.google.com/search?sca_esv=fd9ecb9fe59b5df1&q=%22Python+Developer%22,+%22Django%22,+%22Remote%22,+%22London%22&udm=8&fbs=ABzOT_CWdhQLP1FcmU5B0fn3xuWpUUqWdTgXKUjCV_Ho6Bxst7TRVjZxLUd87vODDaDVhDCYCR0SnLvXXI8V0hOz0l1rKUo23MauOhfphhAu9WOcoLOAhQTw4PG1jBzR635n3Nw8uTjYxZIPr3vNaTrEkN5ITiNQk-WMbwda7ssiXx8Q8Cvi3lFVTMtDbY49EpXUpz5l178S&sa=X&ved=2ahUKEwjMs8-30c2LAxUnQvEDHSUFDOcQs6gLegQIHRAB&biw=1534&bih=781&jbr=sep:0#vhid=vt%3D20/docid%3D41U49cfgp22P6xERAAAAAA%3D%3D&vssid=jobs-detail-viewer", "job_description": "Job descriptionPython / Django Developer - Remote- Full-Stack Python/Django Developer - £65,000 per annumWe are seeking an experienced Full-Stack Developer to join our small but highly effective engineering team, focusing on the development and maintenance of a customised Information Management System.This role requires expert-level Django experience, a deep understanding of its advanced features, and the ...ability to work within Django's strongly opinionated framework.Key Responsibilities• Design, develop, and maintain web applications.• Write clean, efficient, and well-documented code, using platforms such as GitHub.• Participate in code reviews to uphold code quality and best practices.• Troubleshoot and resolve user issues as part of a service desk during business hours (no on-call work).• Stay up to date with industry trends, best practices, and new technologies.Required Skills & Experience• 5+ years of professional full-stack web development experience.• 3+ years of experience building applications with Django, including advanced features such as:• Generic Views• Advanced ORM Usage• Caching• Signals• Custom Middleware• Complex Schema & Data Migrations• Strong expertise in Django Rest Framework (DRF).• Proficiency in PostgreSQL, including writing efficient queries and debugging database performance issues.• Experience with Python's requests library.• Familiarity with Docker, CI/CD pipelines, Linux, and Git.Nice-to-Have Skills• Experience with Redis, NGINX, HAProxy.• Experience working on large codebases.• SC clearance eligibility (not essential but beneficial).Work Style & Environment• Hybrid setup - Remote with one day per week onsite in Leeds.• No on-call work - support required only during business hours.• Work within a small, collaborative team.• Must be eligible to work in the UK and available for occasional travel if required."},
{"job_title": "Senior Python Developer (Remote)", "company_name": "TotalDevs sp. z o.o.", "apply_link": "https://nofluffjobs.com/job/senior-python-developer-remote-totaldevs?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "google_job_link": "https://www.google.com/search?sca_esv=fd9ecb9fe59b5df1&q=%22Python+Developer%22,+%22Django%22,+%22Remote%22,+%22London%22&udm=8&fbs=ABzOT_CWdhQLP1FcmU5B0fn3xuWpUUqWdTgXKUjCV_Ho6Bxst7TRVjZxLUd87vODDaDVhDCYCR0SnLvXXI8V0hOz0l1rKUo23MauOhfphhAu9WOcoLOAhQTw4PG1jBzR635n3Nw8uTjYxZIPr3vNaTrEkN5ITiNQk-WMbwda7ssiXx8Q8Cvi3lFVTMtDbY49EpXUpz5l178S&sa=X&ved=2ahUKEwjMs8-30c2LAxUnQvEDHSUFDOcQs6gLegQIHRAB&biw=1534&bih=781&jbr=sep:0#vhid=vt%3D20/docid%3DJQh9HKdWMf4omBpFAAAAAA%3D%3D&vssid=jobs-detail-viewer", "job_description": "Job descriptionComp: up to £575 p/dContract: 6 - 12 monthsLocation: Remote first (UK based)Stack: Python, Flask, FastAPI, GCP, BigQueryOur long term client is a well known consultancy delivering complete functional solutions. They support engineering teams from FTSE 100 and S&P 500 companies build complex digital strategies. Engineering excellence is at the core of their approach, more than half of they ...employees are engineers.What you will be doing:• Building APIs and integrating them with external platforms• Provide technical guidance and code reviews to other team members• Design, develop and deploy high-performance solutions that process large volumes of dataMust have experience• Quality engineering best practice and tooling including TDD, BDD• Up to date knowledge of Python coding, testing, debugging• Familiarity with Flask, FastAPI, Django, etc.• Experience working with large sets of data• Experience with BigQueryThis is a contract role outside IR35, so you must be UK based and have a company registered in the UK. If you're interested in this opportunity, please click Apply or reach out to iroghina@trg-uk.com for more information."},
{"job_title": "Senior/Expert Python Developer", "company_name": "First Derivative", "apply_link": "https://nofluffjobs.com/job/senior-expert-python-developer-first-derivative-remote?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "google_job_link": "https://www.google.com/search?sca_esv=fd9ecb9fe59b5df1&q=%22Python+Developer%22,+%22Django%22,+%22Remote%22,+%22London%22&udm=8&fbs=ABzOT_CWdhQLP1FcmU5B0fn3xuWpUUqWdTgXKUjCV_Ho6Bxst7TRVjZxLUd87vODDaDVhDCYCR0SnLvXXI8V0hOz0l1rKUo23MauOhfphhAu9WOcoLOAhQTw4PG1jBzR635n3Nw8uTjYxZIPr3vNaTrEkN5ITiNQk-WMbwda7ssiXx8Q8Cvi3lFVTMtDbY49EpXUpz5l178S&sa=X&ved=2ahUKEwjMs8-30c2LAxUnQvEDHSUFDOcQs6gLegQIHRAB&biw=1534&bih=781&jbr=sep:0#vhid=vt%3D20/docid%3D6zQoRo6Kt5wpJ08RAAAAAA%3D%3D&vssid=jobs-detail-viewer", "job_description": "Job descriptionWe are looking for one of our client from USA, which is tech-enabled service providing solutions to the world’s most complex business problems. Driven by our proprietary process orchestration platform, we seamlessly integrate advanced AI and automation with a global network of over 5,000 experts. This powerful combination delivers new capabilities and eliminates barriers to execution for our clien...ts, unlocking unprecedented efficiency, scale, and growth opportunities.As a Contractor Senior Software Engineer, you will contribute to projects across our Client Workplace Platform - where the users of this platform are a globally distributed team of human agents that perform knowledge work for our clients. This workforce is slated to grow 2x - 3x in the next 12 months. You will work in coordination with your engineering manager and other engineers on your team to improve the systems that our clients interact with. You will identify architectural gaps in your area of influence and propose creative solutions that pay dividends in productivity for your team."},
{"job_title": "Mid Python Developer", "company_name": "Link Group", "apply_link": "https://nofluffjobs.com/job/mid-python-developer-link-group-remote-1?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "google_job_link": "https://www.google.com/search?sca_esv=fd9ecb9fe59b5df1&q=%22Python+Developer%22,+%22Django%22,+%22Remote%22,+%22London%22&udm=8&fbs=ABzOT_CWdhQLP1FcmU5B0fn3xuWpUUqWdTgXKUjCV_Ho6Bxst7TRVjZxLUd87vODDaDVhDCYCR0SnLvXXI8V0hOz0l1rKUo23MauOhfphhAu9WOcoLOAhQTw4PG1jBzR635n3Nw8uTjYxZIPr3vNaTrEkN5ITiNQk-WMbwda7ssiXx8Q8Cvi3lFVTMtDbY49EpXUpz5l178S&sa=X&ved=2ahUKEwjMs8-30c2LAxUnQvEDHSUFDOcQs6gLegQIHRAB&biw=1534&bih=781&jbr=sep:0#vhid=vt%3D20/docid%3DtOjfoqMU3eZn6rf8AAAAAA%3D%3D&vssid=jobs-detail-viewer", "job_description": "Job descriptionWe are First Derivative, the world’s largest solution provider dedicated to Capital Markets. We utilise and provide a wide range of consulting and engineering capabilities to solve complex challenges in the Capital Markets domain. We work shoulder to shoulder with our clients, who are all of the top 20 banks across the world right now.We pride ourselves in being creative in finding solutions by ...utilizing a range of specialist skills and experiences across our teams. Bringing deep knowledge together with flexibility and agility for real life problem solving. We feel comfortable working with moving targets and mutable goals as we are confident in our skills and have adapted to fast moving business and technology. We are the solutioneers looking forward to tackling the challenges of the VUCA world."},
{"job_title": "Python Developer(Mid Junior)", "company_name": "Torc", "apply_link": "https://up2staff.com/python-developermid-at-torc?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "google_job_link": "https://www.google.com/search?sca_esv=fd9ecb9fe59b5df1&q=%22Python+Developer%22,+%22Django%22,+%22Remote%22,+%22London%22&udm=8&fbs=ABzOT_CWdhQLP1FcmU5B0fn3xuWpUUqWdTgXKUjCV_Ho6Bxst7TRVjZxLUd87vODDaDVhDCYCR0SnLvXXI8V0hOz0l1rKUo23MauOhfphhAu9WOcoLOAhQTw4PG1jBzR635n3Nw8uTjYxZIPr3vNaTrEkN5ITiNQk-WMbwda7ssiXx8Q8Cvi3lFVTMtDbY49EpXUpz5l178S&sa=X&ved=2ahUKEwjMs8-30c2LAxUnQvEDHSUFDOcQs6gLegQIHRAB&biw=1534&bih=781&jbr=sep:0#vhid=vt%3D20/docid%3Dc9nxxLErlNSMNBhNAAAAAA%3D%3D&vssid=jobs-detail-viewer", "job_description": "Job descriptionMid Python DeveloperAt Link Group, we specialize in building tech teams for Fortune 500 companies and some of the world's most exciting startups. Our mission is to connect talented professionals with opportunities that align with their skills, interests, and career aspirations.We are currently looking for a Mid Python Developer to join our team and contribute to innovative, cutting-edge projec...ts in the IT sector.About the ProjectThe project is in the finance/stock exchange industry, where you will work on developing solutions for managing financial accounts and investments. Our Agile teams employ the latest technologies to ensure high-quality and secure solutions.What We Offer• Tailored opportunities to match your professional interests and goals.• A dynamic and collaborative work environment.• Access to exciting and diverse projects for global clients.• Competitive compensation aligned with your expectations.• Ongoing opportunities for professional growth and development.If you're ready to take on new challenges and work on groundbreaking projects in the IT industry, we'd love to hear from you!Apply today and join us at Link Group to make an impact!"},
{"job_title": "Staff Python Engineer - Remote - £115,000", "company_name": "limitless", "apply_link": "https://uk.linkedin.com/jobs/view/staff-python-engineer-remote-%C2%A3115-000-at-limitless-4151337489?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic", "google_job_link": "https://www.google.com/search?sca_esv=fd9ecb9fe59b5df1&q=%22Python+Developer%22,+%22Django%22,+%22Remote%22,+%22London%22&udm=8&fbs=ABzOT_CWdhQLP1FcmU5B0fn3xuWpUUqWdTgXKUjCV_Ho6Bxst7TRVjZxLUd87vODDaDVhDCYCR0SnLvXXI8V0hOz0l1rKUo23MauOhfphhAu9WOcoLOAhQTw4PG1jBzR635n3Nw8uTjYxZIPr3vNaTrEkN5ITiNQk-WMbwda7ssiXx8Q8Cvi3lFVTMtDbY49EpXUpz5l178S&sa=X&ved=2ahUKEwjMs8-30c2LAxUnQvEDHSUFDOcQs6gLegQIHRAB&biw=1534&bih=781&jbr=sep:0#vhid=vt%3D20/docid%3D4dFEPSqVKVkNHJTTAAAAAA%3D%3D&vssid=jobs-detail-viewer", "job_description": "Job descriptionTime zones: EST (UTC -5), MST (UTC -7), ART (UTC -3), UTC -4, UTC -4:30, UTC -3, UTC -2Our dynamic team is expanding, and we’re in search of a Python Developer who is passionate about technology and eager to make a significant impact. If you’re looking for an opportunity to work on exciting projects in a collaborative, remote environment, we’d love to hear from you.About the Role:As a Python... Developer, you’ll be instrumental in designing, developing, and implementing software solutions to meet our business needs. You’ll collaborate with a talented team to build scalable, high-quality applications and contribute to all phases of the development lifecycle.Responsibilities• Develop and maintain web applications using Python and Python frameworks.• Collaborate with cross-functional teams to define, design, and ship new features.• Work on bug fixing and improving application performance.• Participate in code reviews to ensure robustness, usability, and reliability.• Stay up-to-date with new technology trends, applications, and protocols in Python development.Qualifications• Proven experience as a Python Developer.• Familiarity with Python web stacks and various Python frameworks.• Solid understanding of object-oriented programming.• Experience with front-end technologies (e.g., HTML, CSS, JavaScript) is a plus.• Knowledge of relational databases and version control tools.• Strong problem-solving skills and a detail-oriented mindset.• Excellent communication skills and the ability to work well in a team.• Bachelor’s degree in Computer Science, Engineering, or a related field is preferred."}
]