[
{"job_title": "Engineering Manager & Senior Software Engineer - Python | Remote", "company_name": "Get It - Professional Services", "location": "New York, NY", "time_posted": "5 hours ago", "hiring_manager_first_name": null, "hiring_manager_last_name": null, "hiring_manager_profile": null, "job_url": "https://www.linkedin.com/jobs/view/4167053423/?eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=8xxCq%2FsGYcOO7E922RRovA%3D%3D&trackingId=aGoPnfxDjHnUw5YMMe4jnQ%3D%3D&trk=flagship3_search_srp_jobs", "job_description": "About the job\nThis job is sourced from a job board. Learn More\n\nPosition: Senior Software Engineer and Engineering Manager\n\nLocation: Flexible work arrangements available - New York City or Texas. Choose from on-site, hybrid, or fully remote options.\n\nSalary: Competitive range of \\(115,000 - \\)185,000 (base salary, negotiable based on experience)\n\nJoin a pioneering billion-dollar fintech organization that is redefining the consumer lending landscape! We are actively engaged in reengineering our platforms, tools, and infrastructure, with a strong emphasis on automated underwriting, innovative credit products, and in-house financing solutions.\n\nKey Responsibilities\n\n\nEnsure application functionality through rigorous validation and automated testing to identify regressions.\nConduct code reviews and troubleshoot bugs, guaranteeing optimal application performance.\nCollaborate with a highly skilled and supportive team on diverse, focused projects.\n\n\nRequired Skills\n\n\nExtensive experience in Python, Django, PostgreSQL, JavaScript, React, and Node.js is essential.\nA background in similar technologies will also be considered beneficial.\n\n\nQualifications\n\n\nSenior Software Engineer: A minimum of 5 years of experience in Python, Java, and JavaScript.\nEngineering Manager: At least 7 years of experience in software development and team leadership.\nFamiliarity with the finance sector is advantageous.\n\n\nCareer Growth Opportunities\n\n\nThis role presents significant potential for career advancement within the dynamic fintech sector, providing opportunities to engage with cutting-edge technologies and contribute to impactful projects.\n\n\nCompany Culture And Values\n\n\nOur organization promotes a culture of innovation and collaboration, where diverse ideas are encouraged, creating a vibrant environment for all team members.\n\n\nPlease Note: This position is exclusively open to candidates currently residing in the U.S. Unfortunately, we are unable to provide sponsorship for work visas at this time.\n\nIf you are poised to elevate your career and embark on an exciting journey within the fintech sector, we invite you to connect with us!\n\nEmployment Type: Full-Time"},
{"job_title": "Remote Python Developer with SQL Proficiency", "company_name": "Get It - Professional Services", "location": "Los Angeles, CA", "time_posted": "23 hours ago", "hiring_manager_first_name": null, "hiring_manager_last_name": null, "hiring_manager_profile": null, "job_url": "https://www.linkedin.com/jobs/view/4160790383/?eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=8xxCq%2FsGYcOO7E922RRovA%3D%3D&trackingId=GPr1TPJeq8eyqwWMxTxo7Q%3D%3D&trk=flagship3_search_srp_jobs", "job_description": "About the job\nThis job is sourced from a job board. Learn More\n\nJob Overview\n\nJoin our innovative team as a Python Developer specializing in backend services and SQL. This remote position allows you to leverage your skills in a dynamic environment centered around growth and excellence.\n\nKey Responsibilities\n\n\nDevelop and sustain RESTful API backend services using Python, with frameworks such as Flask, Datadog, and Celery.\nDesign and implement Python SDKs for diverse applications.\nManage programmatic job scheduling and data pipelines using tools like Airflow.\nUtilize Amazon Aurora and/or PostgreSQL within a production setting to ensure seamless data access and integrity.\n\n\nRequired Skills\n\n\nProficient in Python, demonstrating a solid grasp of Object-Oriented Programming principles.\nStrong SQL capabilities complemented by experience in SQL tuning techniques.\nFamiliarity with tools including Pip, Conda, Presto, Hive, and Spark to enhance development efficiency.\n\n\nQualifications\n\n\nDemonstrated experience in backend service development utilizing Python.\nProven proficiency in managing RESTful APIs and backend services.\nA bachelor’s degree in Computer Science, Engineering, or a related discipline is preferred.\n\n\nCareer Growth Opportunities\n\nThis role presents a remarkable opportunity for professional advancement as you will work with cutting-edge technologies and collaborate with a highly skilled team, enhancing your expertise in backend development.\n\nCompany Culture And Values\n\nOur company values innovation, collaboration, and diversity. We foster a supportive remote work culture that emphasizes teamwork and creative problem-solving, allowing you to thrive in your role while maintaining a healthy work-life balance.\n\nNetworking And Professional Opportunities\n\nEngage with industry professionals and expand your network through collaboration and shared learning experiences within our esteemed organization.\n\nCompensation And Benefits\n\n\nCompetitive salary commensurate with experience.\nFlexible work environment promoting a balance between professional and personal commitments.\nOpportunities for continued training and professional development.\n\n\nEmployment Type: Contractor"},
{"job_title": "Python/AWS Developer", "company_name": "BAO Systems", "location": "United States", "time_posted": "58 minutes ago", "hiring_manager_first_name": null, "hiring_manager_last_name": null, "hiring_manager_profile": null, "job_url": "https://www.linkedin.com/jobs/view/4167233763/?eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=8xxCq%2FsGYcOO7E922RRovA%3D%3D&trackingId=6Abyh%2Bbx2z1sRfTn%2BoWb5Q%3D%3D&trk=flagship3_search_srp_jobs", "job_description": "About the job\n\nTitle of job\n\nPython/AWS Developer\n\nLocation of job\n\nUSA\n\nSUPERVISOR\n\nDirector, Informatics\n\nAbout BAO Systems\n\nBAO Systems is an industry leader in digital data solutions for health and development. We empower our partners to implement scalable and sustainable solutions that uncover data-driven insights to improve livelihoods, strengthen health systems, and achieve equitable human development.\n\nOur team comprises passionate public health and development practitioners, information system experts, software engineers, system engineers, Python/AWS Developers, monitoring and evaluation advisors, and data scientists. We excel in providing a broad spectrum of services and products. For more information, please visit www.baosystems.com\n\nPurpose of the role\n\nWe are seeking an experienced Python/AWS Developer to support the implementation of a modern data platform built using serverless AWS architecture for a global health project. We will ensure that data are ingested, processed, stored, and made available to a multitude of stakeholders at the country, project, and global levels for evidenced-based decision making. The platform is the foundation for the program’s business intelligence, data processing, and data extraction tools.\n\nThe ideal candidate understands the full software development lifecycle and approaches software development with a focus on APIs, automation, declarative infrastructure, and continuous integration and deployment. The role involves developing software and solutions using Python, R, and SQL on AWS architecture as well as ensuring quality assurance. This role can be based in the DC area or remote, with the ability to obtain a US Government Public Trust background check.\n\nCore job responsibilities\n\n\nDefine and write acceptance tests to validate the functionality and performance of front-end interfaces and data processing workloads\nCollaborate closely with developers and subject matter experts to understand requirements and design effective test strategies\nCreate sample data sets to simulate real-world scenarios and test various positive and negative scenarios\nExecute test cases, identify and document defects, and work with the development team to resolve issues\nContinuously improve testing processes and methodologies to enhance the overall quality of our data processing systems\nDocument test plans, test cases, and test results for future reference\n\n\nRequired Skills/experience\n\n\nBachelor’s Degree in Computer Science, Engineering, or a related field\n2+ years of hands-on programming experience. \nProven experience as a QA Engineer, Python/AWS Developer, specifically in testing data processing workloads\nStrong knowledge of software testing methodologies, tools, and best practices\nComfort working with APIs, CLIs, and SDKs (Python) for implementing test cases\nProficiency in defining and writing acceptance tests\nFamiliarity with data processing technologies and frameworks\nStrong working knowledge of git, GitHub, and distributed version control systems\nProficient with SDLC processes and working in an agile environment\nExcellent problem-solving and analytical skills\nStrong communication and collaboration abilities\n\n\nDesired Qualifications:\n\n\nStrong experience with AWS services, particularly Cloudformation, Lambda (Python), Step Functions, Glue, DynamoDB, S3, Cloudwatch, SNS/SQS, and API Gateway\nUS Government Experience or International Public Health Background\n\n\nClassification\n\nFull-Time\n\nBAO Systems provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.\n\nBAO Systems provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.\n\nPowered by JazzHR\n\npInCVmngN0"},
{"job_title": null, "company_name": "JustDeal", "location": "San Francisco Bay Area", "time_posted": "24 minutes ago", "hiring_manager_first_name": null, "hiring_manager_last_name": null, "hiring_manager_profile": null, "job_url": "https://www.linkedin.com/jobs/collections/recommended/?currentJobId=4162696400&eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=NRcVyw74I2%2Bsc5QMJWkGdg%3D%3D&trackingId=RQ%2BesKdW68xGSfv47oIauw%3D%3D", "job_description": "About the job\n\nAt JustDeal, we're redefining how B2B sales teams handle pricing, approvals, and risk—automating the entire process with AI. Our mission is to build fast, scalable, and intelligent systems that empower businesses to close deals faster.\n\nWe’re looking for a Software Engineer in Test (SDET) Intern to help build and enhance our test automation framework, ensuring the reliability and performance of JustDeal’s platform. If you’re passionate about breaking things before customers do and love writing automation scripts, this role is for you!\n\n\n\n\nWhat You’ll Do\nDevelop automated test frameworks for web applications, APIs, and backend services.\nDesign and execute integration, regression, and performance tests to validate system reliability.\nWork closely with software engineers to identify and resolve defects early in the development cycle.\nImplement CI/CD testing pipelines to automate quality assurance processes.\nGain hands-on experience with Selenium, Cypress, Playwright, JUnit, pytest, or other testing tools.\n\n\n\n\nWhat We Look For\nPursuing a Bachelor in Computer Science, Software Engineering, or a related field (graduating Dec 2025 or later). No Masters/PhD.\nMust be a US Citizen.\nStrong coding skills in Python, Java, JavaScript, or TypeScript for test automation.\nFamiliarity with testing frameworks like Selenium, Playwright, Cypress, JUnit, or pytest.\nExperience or coursework in CI/CD, DevOps, or cloud-based testing (AWS/GCP/Azure) is a plus.\nPassion for automation, debugging, and delivering high-quality software.\n\n\n\n\nWhy JustDeal?\n\n✅ Work on real-world automation projects that impact product reliability with paid salary.\n\n✅ Gain exposure to end-to-end testing in a fast-moving AI-driven startup.\n\n✅ Collaborate with top engineers and learn best practices in software quality assurance.\n\n✅ Flexible work environment—remote, hybrid, or in-office options available."}