[
{"job_title": "Scala Developer (AI Trainer)", "company_name": "micro1", "location": "APAC", "time_posted": "9 hours ago", "hiring_manager_first_name": "Chirag", "hiring_manager_last_name": "Patel", "hiring_manager_profile": "https://www.linkedin.com/in/chirag-patel-605203262", "job_url": "https://www.linkedin.com/jobs/view/4157136322/?eBP=NOT_ELIGIBLE_FOR_CHARGING&refId=iUsn4c0l1hQPpFxV1j2hhg%3D%3D&trackingId=hX2qC8s93VPd%2FdCABKAUxg%3D%3D&trk=flagship3_search_srp_jobs", "job_description": "About the job\n\nAbout Us:\n\nOur mission at micro1 is to match the most talented people in the world with their dream jobs. If you are looking to be at the forefront of AI innovation and work with some of the fastest growing companies in Silicon Valley, we invite you to apply for a role. By joining the micro1 community, your resume will become visible to top industry leaders, unlocking access to the best career opportunities on the market.\n\n\n\n\nJob Summary:\n\nWe are seeking a skilled Scala Developer to join our dynamic team as an AI Trainer. This is an exciting opportunity to contribute to the development of cutting-edge AI technologies through the power of Scala. As a remote full-time role, you will collaborate closely with innovative professionals who are passionate about artificial intelligence and its applications.\n\n\n\n\nKey Responsibilities:\n\nDevelop and maintain scalable AI training frameworks using Scala.\nDesign and implement complex algorithms to enhance AI performance.\nConduct data analysis and manipulation with SQL to support AI training processes.\nCollaborate with cross-functional teams to integrate AI solutions into business models.\nContinuously evaluate and improve AI training methodologies.\nCommunicate effectively in writing and verbally, ensuring clarity and precision in AI documentation and presentations.\nStay up-to-date with the latest trends and advancements in the AI and Scala domains.\n\n\n\n\nRequired Skills and Qualifications:\n\nProven experience in Scala development and AI training methodologies.\nProficiency in SQL for data analysis and management.\nStrong verbal and written communication skills, with an emphasis on clarity and accuracy.\nAbility to work independently in a remote setup, demonstrating self-motivation and discipline.\nSolid understanding of machine learning algorithms and AI integration.\nProven problem-solving skills and attention to detail.\nPrevious experience in a similar role or industry is advantageous.\n\n\n\n\nPreferred Qualifications:\n\nExperience with cloud-based AI platforms and tools.\nFamiliarity with other programming languages, such as Python or Java.\nAdvanced degree in Computer Science, AI, or related field."},
{"job_title": "VR Game Developer (Fresher - Entry Level)", "company_name": "Video Analytics Lab - AI & AR-VR", "location": "Karāchi, Sindh, Pakistan", "time_posted": "2 days ago", "hiring_manager_first_name": null, "hiring_manager_last_name": null, "hiring_manager_profile": null, "job_url": "https://www.linkedin.com/jobs/view/4152231508/?eBP=CwEAAAGVFB6eyuwZHVlVeQrb8FRCwlBxTRosNkcDtYoCSUHx-ode7OhrUNW25UUMfmfSZSe_tmNM0KoGt-W05T8muUwxgH52Tlzo3sZHqIA6fIIi5rSRygPDmdGw8jofN6bIxCsvXskPOmg7IVO3D4n4tCAj83ZRFpsZKCNwuJWnFmQhsLhUXAuVGyuHHnSlxesgDG3Va1aJY7RBwieT2zeMzFaU6BIRlo1Lqf9sG_yXoq8XDWKVUi63sB8oI57bqN7YrZEjbhGc0Untr0-pWXwJA-p2q4MK3g-U29y4QCobnhJSvWZhSFrTH79M9vgZf3qd4pfG87eE9NieoeboBFeih52AWN3EaTa3QL1E6EJ9AULOz11kDQHOU9V4Gu7QJz1x6L5zuIxJI2DopH4j5GIHpsDDbhAvqxJcZApHe3CdB0e5uh4Z2c8XeGlHNtyKOgFLep4A7wpcfCVRLvqQZ6zg_Pvyeb-hb65fWkEPfGYXQ7RfLT0UvVLz1dgeEmo0Jj4FxblMnE9NKm-98KAnyG9d&refId=iUsn4c0l1hQPpFxV1j2hhg%3D%3D&trackingId=bsVtOstwwb8OHxFNIaDnHA%3D%3D&trk=flagship3_search_srp_jobs", "job_description": "About the job\n\nAbout Us\n\nAt Video Analytics Lab - AI, we are redefining how we interact with visual data by developing cutting-edge VR simulations and immersive training programs. Join our team to build innovative VR-optimized models and gain hands-on experience in the growing world of AR and VR development.\n\n\n\n\nRole Overview\n\nAre you a passionate fresher with a knack for creating immersive 3D environments? As a VR Game Developer, you’ll contribute to the development of high-quality 3D assets for VR and AR applications. This role is ideal for candidates with academic projects, personal VR/AR prototypes, or internship experience in game development.\n\n\n\n\nKey Responsibilities\n\n🔹 3D Model Development – Create optimized 3D models for AR/VR environments, ensuring efficient topology for real-time applications.\n\n🔹 Texturing & Shading – Apply textures, materials, and shaders to enhance realism and performance.\n\n🔹 Lighting & Rendering – Implement realistic lighting and shading techniques for immersive visuals.\n\n🔹 Game Engine Proficiency – Work with Unity or Unreal Engine (both preferred but not required).\n\n🔹 Photogrammetry & Mesh Conversion (Bonus!) – Familiarity with photogrammetry and converting high-poly meshes into game-ready assets.\n\n\n\n\nRequirements\n\n✅ Educational Background – Bachelor's degree (or final-year student) in Game Development, Computer Science, 3D Art, or a related field.\n\n✅ Technical Skills:\n\nProficiency in Unreal Engine or Unity (at least one required).\nStrong understanding of 3D modeling, texturing, and material creation.\nBasic knowledge of photogrammetry workflows (preferred but not required).\n✅ Portfolio – Showcase your academic projects, personal game demos, or 3D models in your application.\n✅ Learning Mindset – Eagerness to improve and work in a fast-paced environment.\n\n\n\n\nWhat We Offer\n\n💡 Hands-on VR Experience – Work on real-world projects with industry experts.\n\n🚀 Career Growth – A chance to learn and develop your skills in a growing field.\n\n🎮 Creative Freedom – An open environment where fresh ideas are encouraged.\n\n💰 Competitive Compensation – Salary based on skills and experience.\n\n\n\n\nHow to Apply\n\n📩 Send your resume and portfolio to [mfaisal@pnec.nust.edu.pk]. Highlight your projects, game development experience, or VR/AR work, even if they are self-initiated or academic.\n\nThis is a great entry-level opportunity for those excited about VR, AR, and 3D game development. If you're passionate about creating immersive experiences, we’d love to hear from you! 🎮✨"},
{"job_title": "Zoho Integration Developer", "company_name": "Beaconhouse Technology", "location": "Pakistan", "time_posted": "56 minutes ago", "hiring_manager_first_name": "Maryam", "hiring_manager_last_name": "Zaka", "hiring_manager_profile": "https://www.linkedin.com/in/maryam-zaka", "job_url": "https://www.linkedin.com/jobs/view/4152763495/?eBP=CwEAAAGVFB6eysKq5gjQBBrOWHZzr4khkW5GybbUT4yo3HBAPte4gAJlEsl24ZK69N_XJU42kb3AGd69Zc1R2JIWY6MQlgEPKICabBy9zciPxlDBB8dekfIWK9xSpZA3K3BbnQS88xEoC3sljzfIEaWHAm5q3TFJY-Da86A9c-2GNC7cadKZcYOCRCLc3juJc1-910DNzV4qXu5jnyJTE9vTt3JkVM9G4QdNpFLtc2ezL9Cz9rxN6ABSNNLSlPRtiz1STr0T_yWy7pU3f_Y6Rz6tlfDkea8G1T9UDHPCC5l_bxnHJrIrbgjVP2Y5SfBqO1uBO5nRDNiRDNBbldDtivLvkWg5ZHUydJga9SPrz2CJA1R8RiolImAveUvOy2_shfItX2fIeDV-E9_ITcrFLyQXiSsZ0iTWLUaEA7MBzGe7KeBkmjzOV4vUqChi9uiq76ZoDBxLyIh2qtGlR-bv70taRHSoqqeKYSOUqwYFy84&refId=iUsn4c0l1hQPpFxV1j2hhg%3D%3D&trackingId=A4cs1c1srnVv4YQPgg3D2Q%3D%3D&trk=flagship3_search_srp_jobs", "job_description": "About the job\n\nJoin Our Dynamic Team as a Zoho Integration Developer!\n\nAs a Zoho Integration Developer, you will play a key role in designing and implementing seamless data synchronization between Zoho CRM, Microsoft Dynamics 365 Business Central, and Shopify. You will collaborate with cross-functional teams to develop, test, and deploy efficient integration workflows, ensuring smooth data exchanges and automation.\n\nAbout Us\n\nWe are a young dynamic tech company committed to innovation and excellence, backed by a 50-year old conglomerate in education. Our collaborative environment encourages creativity, growth, and continuous learning. Join our team and make a positive impact!\n\nWhat You’ll Do\n\nDevelop, test, and deploy integrations for Zoho CRM & Microsoft Business CentrDevelop, test, and deploy integrations for Zoho CRM & Microsoft Business Central, including sales quotes, invoices, inventory, and vendor data.\nEnsure seamless data synchronization between Shopify & Business Central for orders, inventory, and customer details.\nUtilize Power Automate, Zoho Flow, or custom API development to automate workflows.\nAlign data models between different systems using OData, REST, and GraphQL APIs.\nImplement error detection, troubleshooting mechanisms, and system monitoring.\nEnsure OAuth 2.0 authentication, GDPR compliance, and role-based access control.\nCollaborate with Sales, Finance, and IT teams to optimize integration workflows.\n\nWhy Join Us?\n\nWork on leading-edge projects with top international developers.\nGain hands-on experience in ERP-CRM-Ecommerce integrations.\nImpact our product, services, and company growth.\nParticipate in company-sponsored events.\nEnjoy flexible hours and remote work options.\n\nRequired Skills:\n\nBachelor's degree in Computer Science, IT, or a related field.\nExtensive experience with Zoho CRM (Deluge scripting, Zoho REST API, Zoho Flow).\nStrong knowledge of Microsoft Business Central (AL programming, OData APIs, Power Automate).\nExpertise in Shopify (REST & GraphQL APIs, Liquid, Shopify Plus B2B preferred).\nExperience in middleware & automation (Node.js/Python, Azure Logic Apps, Power Automate).\nProficiency in database management (SQL Server, Dataverse).\nKnowledge of authentication & security protocols (OAuth 2.0, API Keys, Webhooks).\nFamiliarity with cloud platforms such as Azure or AWS (preferred).\nStrong problem-solving skills and ability to work independently.\n\nBenefits:\n\nCompetitive compensation based on experience and matching industry standards\nFlexible work schedule\n\nAt Beaconhouse Technology, we value our employees and provide the resources they need to succeed. If you’re passionate about Zoho development and integrations, apply now for this exciting opportunity as a Zoho Integration Developer! 🚀"}
 ]