[
{"job_title": "Junior MERN Developer - (Web 3 and blockchain)", "company_name": "S4Digital", "location": "Faisalabad, Punjab, Pakistan", "time_posted": "3 hours ago", "hiring_manager_first_name": "Shahana", "hiring_manager_last_name": "Arif", "hiring_manager_profile": "https://www.linkedin.com/in/shahana-arif-346535193", "job_url": "https://www.linkedin.com/jobs/view/4149451292/?eBP=CwEAAAGVGbFuYG9I3CLqJD6CXKJaoGlFY1AKBbOUdhr1PS3wnadgmuL6kwgHKLOEKztswuFVMoCL6SPEpPS-Ix3PDWQE-pMmGbw5vj6ZbDn3L2-N0pFCLSmv6WydJopGIB0KWSP_3uuW67YoBxBvHg_rLt5q4yiufGosGK5VH53qPB9xAfPoJJ3fP4Mpw2v_GTQDrTyekq60RWymzWzCkdXgjrym_-OhlgsKq3f405FRxc0QY72dQnpkOOMAr1VEzX8hvFOwa4qtSDRdcTgP2qRaUNKejW9gyu2yocYkmjAFHF5Kys1NdirfywxLrCjCw8c5vMMJWHcF-5rvGULk_Oz0NEnS5fFbd8L75pgjOr_e8p-Pzj8DW97YBUW2nIRgnRuu7G5V7aKVZwTtHnTfrWlxWdVWD-8yxLCNGS587UNKzucUBnUJBCIdNiLBlQbTcT0n-dv8jDUD4_4To2IVwCqXZrp9VkFtsdhBZ_EYVmf1S8i8cR7I8tglx1zjrMKpu3uJtUtindEtRztzM41JvNtWeA&refId=Ov23L00%2BWp6Z0EFtkEbolA%3D%3D&trackingId=t6RL1AS8MEwgdwRcvX%2FEeQ%3D%3D&trk=flagship3_search_srp_jobs", "job_description": "About the job\n\nAbout US: \n\nHR Ways is an Award winning Technical Recruitment Firm helping software houses and IT Product companies internationally and locally to find IT Talent. HR Ways is engaged by 300+ Employers worldwide ranging from worlds biggest SaaS Companies to most competitive Startups. We have entities in Dubai, Canada, US, UK, Pakistan, India, Saudi Arabia, Portugal, Brazil and other parts of the world.\n\nJunior Mern Stack Developer- Onsite- Faisalabad\n\nCompany Overview:\n\nHiring one of the the first of its kind technology solutions provider, using a blend of solution and innovation, with software and technology at the forefront, they aim to automate lives like it has not been known before.\n\nWorkforce: 50+\n\nJob Description: Backend Engineer (MERN Stack)\n\nWe are seeking a Junior Backend Engineer with over 2 years of experience in the MERN stack (MongoDB, Express.js, React.js, Node.js) to build and maintain scalable backend systems and APIs. The ideal candidate should be proficient in server-side logic, database management, and API integrations, ensuring high performance and responsiveness across applications.\n\nKey Responsibilities:\n\nBuild and maintain backend applications using Node.js and Express.js.\n\nDesign, manage, and optimize MongoDB databases for scalability and performance.\n\nDevelop and maintain RESTful APIs to enable seamless client-server communication.\n\nCollaborate with frontend developers to ensure smooth integration with React.js components.\n\nImplement authentication, authorization, and data security best practices.\n\nTroubleshoot and optimize backend performance issues.\n\nStay up to date with the latest tools and practices in the MERN stack.\n\nRequirements:\n\n2 + years of backend development experience with the MERN stack.\n\nStrong command of Node.js, Express.js, and MongoDB.\n\nExperience with building and consuming APIs.\n\nFamiliarity with React.js for effective collaboration with frontend teams.\n\nKnowledge of authentication methods (JWT, OAuth) and security best practices.\n\nExperience with version control (Git) and CI/CD pipelines.\n\nKnowledge of cloud platforms like AWS, GCP, or Azure is a plus.\n\nWe are looking for someone who is proactive, detail-oriented, and ready to build robust backend solutions for scalable and innovative applications.\n\nOther Details:\n\nLocation: Faisalabad, \n\nExperience: 2 + years\n\nSalary: Market Competitive\n\nTimings: Monday to Friday : 10:00 A.M – 7:00 PM (Full time)"},
{"job_title": "Engineer", "company_name": null, "location": "Karāchi, Sindh, Pakistan", "time_posted": "7 hours ago", "hiring_manager_first_name": "Khizer", "hiring_manager_last_name": "Munir", "hiring_manager_profile": "https://www.linkedin.com/in/khizer-munir-b37b3813a", "job_url": "https://www.linkedin.com/jobs/view/4153681585/?eBP=CwEAAAGVGbFuYLvdD9DIDGdBvQWn-6f9SXfaUHKftaP9n8T4lXnU6_UyjhJ05jeXvAbep7TypeQFyYHlF6-W61iLqg7V_JetqvLi4w26bNCp4U6_fYNdxmwluj7dy_XJpi_f9FvO4Xs6Bxk4ZnMOgJIyMa7likGltfROuAMvgv2Kr5r2UQ_5n4G5jHUmB_D7h9-DxZAziQjFfcugfoZzdy96_zmJegsvB000YMZ07twY1TjDB67Kk3aQt_vjx0iDjCNFxmaGwUY0BgpOGdNv9AgAEwU8WRCKnK9kCZYJaU4hhe0EojKErgZs5irxzj0Afhgjak9ng9nR0HrzzdksPemueAzLfG1hKdwZFgkvRrtr2uiUQi28qC3AMT3QpEKJ-edXhOe1BPd7nip6f08ph04vdd8gtBOtuWLZL4nr8rMc7YdyNCGzuiwN4z70AKLLgfKBdq-IlL-QKfvIiWbA4T1qcGGdrqPZlSHIp85YZCsxoU7lKNq0s_NEMA2SD7Kw8jU24U-bqSpBbKU92JDH89d2yg&refId=Ov23L00%2BWp6Z0EFtkEbolA%3D%3D&trackingId=Im3K%2B8PQLoYQFUdERzBnog%3D%3D&trk=flagship3_search_srp_jobs", "job_description": "About the job\n\nCivil Engineering Graduate (Remote - USA)\n\n\n\n\nWe are seeking motivated Civil Engineering Graduates to join our team. This is a remote position within the USA, offering flexibility and opportunities for growth. The ideal candidate will have a strong foundation in civil engineering principles, proficiency in AutoCAD Civil 3D, and the ability to work independently while adhering to city, county, and state regulations.\n\n\n\n\nKey Responsibilities:\n\n • Design and develop sub-surface utility systems, drainage systems, and pavements using AutoCAD Civil 3D.\n\n • Ensure compliance with city, county, and state regulations in all projects.\n\n • Collaborate remotely with the team to deliver high-quality engineering solutions.\n\n\n\n\nRequirements:\n\n • Fluent in English (both written and spoken).\n\n • Recent graduate in Civil Engineering or related field.\n\n • Proficiency in AutoCAD Civil 3D for designing and drafting civil engineering projects.\n\n • Strong understanding of design principles for utilities, drainage, and pavements.\n\n • Familiarity with city, county, and state regulations is essential.\n\n\n\n\nSalary & Benefits:\n\n • Competitive salary between 40,000 - 80,000 PKR with potential for growth.\n\n • Opportunities for career advancement and development.\n\n\n\n\nHow to Apply:\n\n • Send your CV to Muhamamdj@engineering.com.\n\n • For more details or inquiries, feel free to reach out via LinkedIn or Facebook.\n\n\n\n\nWe look forward to your application!"},
{"job_title": "MERN Stack Developer Frontend Engineer", "company_name": "BJS Soft Solutions", "location": "Lahore, Punjab, Pakistan", "time_posted": "4 weeks ago", "hiring_manager_first_name": null, "hiring_manager_last_name": null, "hiring_manager_profile": null, "job_url": "https://www.linkedin.com/jobs/view/4130725060/?eBP=BUDGET_EXHAUSTED_JOB&refId=Ov23L00%2BWp6Z0EFtkEbolA%3D%3D&trackingId=WhVgTs6Hdp4Iro2VS8iavQ%3D%3D&trk=flagship3_search_srp_jobs", "job_description": "About the job\n\nBy Harriet Ann Amin / January 20, 2025\n\nAbout Us\n\nBJS Soft Solutions is rapidly growing across the country, both organically and by bringing in like-minded managed IT service providers (MSPs). We’re building a national network that can provide exceptional service to our clients.\n\nAn Adaptive Platform for the Evolving Global Asset and Get a chance to work with a global network.\n\nMern Stack Developer\n\nJob Description\n\n\nArchitect robust and scalable MERN Stack applications\nCreate and implement software verification and validation strategies\nEnhance code quality by writing unit tests, automating processes, and conducting code reviews\nWork closely with a diverse team of MERN Stack developers, project managers, UX designers, system administrators, and analysts\nLead the creation of comprehensive documentation, encompassing tests, analytics, and troubleshooting procedures\nContribute innovative ideas in the realms of technology, algorithms, and product development\nTackle challenges and proactively resolve issues as they emerge\n\n\nRequirements\n\n\nExperience: 1-2 Years\nJob Type: Full time/ On-site\nGender: Male/ Female\nSalary: Market Competitive\nVacant Seats: 1\n\n\nHow To Apply\n\n\nRead the job description thoroughly to understand the position’s requirements, responsibilities, and qualifications.\nBefore starting the application, gather all the relevant information you’ll need to complete the form.\nEnter details and customize your cover letter to address the specific job and explain why you’re a good fit for the position.\nUpload your resume or CV. Ensure that it is updated and tailored to the job you’re applying for.\n\n\nWhile prior experience is not required, any foundational knowledge or coursework in programming, data structures, or databases would be advantageous.\n\nJob Category: Frontend Developer Software Engineer\n\nJob Type: Full Time\n\nJob Location: 101 Regency Plaza MM Alam Road Lahore\n\nApply for this position\n\nFull Name *\n\nEmail *\n\nPhone *\n\nCover Letter *\n\nUpload CV/Resume *Allowed Type(s): .pdf, .doc, .docx\n\nBy using this form you agree with the storage and handling of your data by this website. *"},
{"job_title": "Next JS Developer", "company_name": "Genesis IT Lab", "location": "Islamabad, Islāmābād, Pakistan", "time_posted": "2 weeks ago", "hiring_manager_first_name": null, "hiring_manager_last_name": null, "hiring_manager_profile": null, "job_url": "https://www.linkedin.com/jobs/view/4139683012/?eBP=BUDGET_EXHAUSTED_JOB&refId=Ov23L00%2BWp6Z0EFtkEbolA%3D%3D&trackingId=jOUwom%2F8pzl2AN1z2xsvqg%3D%3D&trk=flagship3_search_srp_jobs", "job_description": "About the job\n\nThis is a remote position.\n\n\nDevelop and maintain web applications using Next.js and React. \nIntegrate blockchain technologies (e.g., Ethereum, Solana, or others) into web applications, including smart contracts, wallets, and decentralized applications (dApps). \nImplement AI/ML models into web applications for features such as predictive analytics, natural language processing, or computer vision. \nCollaborate with designers to create responsive, visually appealing, and intuitive user interfaces. \nOptimize applications for performance, scalability, and security. \nWork with server-side rendering (SSR) and static site generation (SSG) in Next.js. \nIntegrate with RESTful APIs, GraphQL, and blockchain APIs (e.g., Web3.js, Ethers.js). \nWrite clean, maintainable, and well-documented code. \nTroubleshoot and debug issues across the stack. \nStay updated on the latest trends and advancements in blockchain, AI, and web development. \nCollaborate with backend developers, data scientists, and blockchain engineers to ensure seamless integration of technologies. \nParticipate in code reviews and provide constructive feedback to peers. \n\n\nRequirements\n\n\nProven experience as a Next.js Developer or similar role. \nStrong proficiency in JavaScript (ES6+) and React. \nHands-on experience with blockchain technologies (e.g., Ethereum, Solana, Hyperledger) and tools like Web3.js, Ethers.js, or Truffle. \nExperience integrating AI/ML models into web applications (e.g., TensorFlow.js, PyTorch, or custom APIs). \nFamiliarity with smart contract development (e.g., Solidity, Rust) and deploying decentralized applications (dApps). \nKnowledge of RESTful APIs, GraphQL, and WebSockets. \nUnderstanding of SEO principles and their implementation in Next.js. \nKnowledge of AI-driven APIs (e.g., OpenAI, Hugging Face) and their integration into web applications. \n\n\nBenefits\n\n\nCompetitive salary and benefits package. \nFlexible working hours and remote work options. \nOpportunities for professional growth and development. \nA collaborative and inclusive work environment. \nAccess to the latest tools and technologies. \nRegular team-building activities and events. \nThe chance to work on groundbreaking projects at the intersection of blockchain, AI, and web development."}
]