[
{"first_name": "Ishita", "last_name": "Gudena", "tagline": "HR Specialist || Business Consultant || Social Media Optimization || WORK FROM HOME", "profile_url": "https://www.linkedin.com/in/ishita-gudena-3b6a08308?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAE51sDoBQIP0qIVqaRJuZcDJIRn0_ZQJDog", "job_link": null, "job_description": "Exciting Opportunities for hashtag#Freshers in hashtag#Java, hashtag#Python, hashtag#MERN, and hashtag#MEAN!!!hashtag#Job Details:1. hashtag#Roles: Java Developer, Python Developer, MERN Developer, MEAN Developer2. hashtag#Experience: 0-1 year3. hashtag#Education: Any degree4. hashtag#Location: Hybrid/Remote5. hashtag#Salary: ₹25,000 - ₹32,000 per monthHow to hashtag#Apply: Like the post and comment hashtag#Interestedhashtag#Perks:1. Flexible hybrid/remote work arrangement2. Competitive salary and benefits3. Opportunities for growth and development4. Collaborative and dynamic work environmenthashtag#FresherHiring hashtag#SoftwareDeveloper hashtag#JavaDeveloper hashtag#PythonDeveloper hashtag#MERNDeveloper hashtag#MEANDeveloper hashtag#HybridJob hashtag#RemoteJob hashtag#JobOpening hashtag#CareerOpportunity"},
{"first_name": "Hira", "last_name": "Khan", "tagline": "Talent Acquisition Manager | Creating Exceptional Hiring Experiences & Employer Branding | Talent Connector | Freelance Recruiter", "profile_url": "https://www.linkedin.com/in/hira-khan-7448b164?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAA2opeQBXhxooCSYWcduXrAcot8tYt1rKwk", "job_link": null, "job_description": "hashtag#remoteopportunityLooking for a Full Stack Python Developer with hands on experience in Hubspot and excellent communication skills.Qualification: At least BS(CS)Experience: 4 years Job Type: Full-time, remoteSalary will be paid in USDApplications are welcome from all over Pakistan. Interested candidates can DM their resumes.hashtag#taxfree hashtag#urgenthiring hashtag#pythondeveloper hashtag#techjobs hashtag#pakistanjobs hashtag#opportunity2025"},
{"first_name": "Abdul", "last_name": "Mannan", "tagline": "Assistant Manager HR at Angular Quantum l Talent Acquisition Specialist | Recruitment Lead | Workplace Wellness l", "profile_url": "https://www.linkedin.com/in/abdulmannan90?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADU8Xt0BzeacfDRNwE2XjLy9l9dyzS2_rw4", "job_link": null, "job_description": "Urgent Hiring Alert!Position: Python Developer *Male*Expertise in Flask, Django, FastAPI, Containerization technologies like Docker.🔔 Must know about front end as well Job Location: Remote/PakistanTimings: 12pm to 9pm (Remote) PakistanOrganization: Angular Quantum Interested candidates may share their resumes at: abdulmannan@angularquantum.com or DM"},
{"first_name": "Asif", "last_name": "Hussain", "tagline": "Billing Supervisor at MedPro Billers (hr@mpbillers.com)", "profile_url": "https://www.linkedin.com/in/asif-hussain-58714823b?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADukuTcB09v3fS_EDxIIhubdQASAcAW6i0A", "job_link": null, "job_description": "Job Title: Python DeveloperCompany: Jeevay SoftLocation: RemoteSalary: 250,000 PKR per monthWorking Hours: 8:00 PM - 4:00 AM (7 working hours with a one-hour break)Working Days: Monday to SaturdayAbout Jeevay Soft:Jeevay Soft is a dynamic and innovative tech company specializing in cutting-edge software solutions. We seek a skilled Python developer to join our team and contribute to developing our J-Health Laboratory Information Management System (LIMS).Responsibilities:Develop and manage Python-based solutions.Collaborate with the Python Team Lead to deliver high-quality results.Set up and managed interfaces for the J-Health (LIMS) system, ensuring compatibility with multiple laboratory information systems (LIS) and machines.Troubleshoot and resolve issues efficiently to maintain seamless system operations.Ensure best practices in code quality, security, and system performance.Requirements:Proficiency in Python programming with a strong understanding of its frameworks and libraries.Prior experience in integrating systems and working with APIs.Knowledge of laboratory systems or healthcare software is a plus.Strong problem-solving skills and the ability to work independently under the guidance of a team lead.Dedication, a strong work ethic, and excellent communication skills. What We Offer:Competitive monthly salary of 250,000 PKR.Opportunity to work on impactful projects in the healthcare domain.A supportive and collaborative team environment.Flexible remote working arrangements.Probation Period:This role includes an initial 3-month probation period, during which we will evaluate your performance, dedication, and overall contribution to the team.How to Apply:If you're a passionate Python developer ready to take on this exciting opportunity, we want to hear from you! Send your updated resume and a brief cover letter to 0302-9397893&Hr@mpbillers.com with the subject line \"Application for Python Developer - Jeevay Soft.Join us in revolutionizing the healthcare tech industry!hashtag#Hiring"},
{"first_name": "jawad", "last_name": "Jutt", "tagline": "Senior Full Stack Developer at RootPointers", "profile_url": "https://www.linkedin.com/in/jawad-jutt-b06a6493?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABPpbzYBgegd9Pr3oxqbFUCFUXlwp_fXR4w", "job_link": null, "job_description": "Job Opportunity: hashtag#PythonDeveloper at RootPointersRootPointers is  is urgently seeking skilled Python Developers to join our dynamic team! We have multiple openings for Full-time Onsite, Remote, and Project-based roles. If you have 1.5 to 2 years of proven experience and are ready to contribute to impactful projects, we want to hear from you.Key Requirements:1.5 to 2 years of hands-on experience in Python developmentProficiency in frameworks like Django or FlaskExperience in building and integrating RESTful APIsStrong understanding of Object-Oriented Programming (OOP) principlesFamiliarity with front-end technologies (HTML, CSS, JavaScript)Database expertise with PostgreSQL or MySQLExperience with ORM tools such as SQLAlchemy or Django ORMVersion control using GitKnowledge of cloud services (AWS or Azure) is a plusPosition Details:📍 Location: Canal View, Lahore🕐 Job Type: Full-time Onsite, Remote, or Project-basedWe invite passionate candidates to share their resumes at Hr@rootpointers.com with the position title mentioned in the subject line.When submitting your resume, please include the following details:1️⃣ Total years of experience in Python2️⃣ Current Salary3️⃣ Expected Salary4️⃣ Notice PeriodJoin us at RootPointers and be a part of a team that's shaping the future of innovative development!hashtag#hiring hashtag#job hashtag#opportunity hashtag#pythondeveloper hashtag#remotejobs hashtag#projectbasedwork hashtag#hiringalerts hashtag#lahorejobs hashtag#rootpointers"},
{"first_name": "Muhammad", "last_name": "Talha", "tagline": "Frontend Developer | ReactJS & Tailwind Enthusiast | Aspiring Full-Stack Developer | Crafting Responsive & Scalable Web Solutions", "profile_url": "https://www.linkedin.com/in/muhammad-talha-0652bb1bb?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADMfzY0BUA0erSV7962UUKhWhzValKl_JEs", "job_link": null, "job_description": "hashtag#Hiring Alert for \"Entry level\"!US Candidates (Remote)1. Front End Developer.2. Data Analyst.3. Back End Developer.4. Android Developer.6. Flutter Developer.6. WordPress Developer.7. Angular Developer,8. JavaScript Developer.9. Python Developer.10. Full Stack Developers.Location:- RemoteEXP:- Interns To 5 YearSalary:- $700 To $4400 / MonthlyHow To Apply Comment hashtaghashtag#Interested \" in below Comment Box, So we will review your Profile.Follow me for jobs actively hiring now and land your dream job!Guys, when we see a post of this type, we must think a little before we run and comment on it with the word \"interested\" or \"interested\", we are programmers and we have enough awareness.Is it really in a reputable company that will hire someone who is attached to the word ZD?Is there a company that will talk or see the profile of the 10-15 thousand comments and evaluate the choice of comments based on which?If the company is serious, it will ask to send your CV to e-mail, or communicate via WhatsApp, form, or LinkedIn.Other than that, this is often someone who tries to gather followers and Rich on the empty.Let us be more conscious, and make sure before we waste our time on meaningless needs."},
{"first_name": "Wadia", "last_name": "Nauman", "tagline": "Talent and Culture Champion: Innovating, Acquiring, Motivating – Creating a Future of Excellence", "profile_url": "https://www.linkedin.com/in/wadianauman?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAABtDlewBZxkqvpQ-9OwGr_dkhZzBGpMMkyw", "job_link": null, "job_description": "🌟 Exciting Opportunity for Python Developers! 🌟We’re an Australian company on the lookout for talented Python Developers with experience in the energy sector to join our team on a full-time, 100% remote basis! 🔹 Job Type: Full-Time Remote 🔹 Experience: 3-5 Years 🔹 Salary: Up to $3,000 AUD per month🔹 Skills: Excellent communication skills requiredIf you’re an experienced Python Developer with strong communication skills and are interested in a remote role, we’d love to hear from you!Interested or know someone who might be a great fit? Drop me a message or tag them in the comments. Let’s connect and explore this opportunity together!hashtag#Hiring hashtag#PythonDeveloper hashtag#RemoteJobs hashtag#AustralianCompany hashtag#TechJobs hashtag#CareerOpportunities"},
{"first_name": "Hira", "last_name": "Tariq CHRP®", "tagline": "Human Resource Professional | Talent Acquisition Specialist | HR Generalist | People Management | Learning & Development | Organisational Development Practitioner | Freelance Recruiter", "profile_url": "https://www.linkedin.com/in/hira-tariq-chrp?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAAEY7644BH2bZaT5mr7l1qgTvwWt7-2QGgPY", "job_link": null, "job_description": "Job opportunity RemoteJob Title: Python DeveloperReactive Space is seeking an experienced Python Developer to join our innovative team. As a Python Developer, you will play a crucial role in designing, developing, and maintaining our cutting-edge software solutions.Responsibilities:Design, develop, test, and deploy scalable Python applicationsCollaborate with cross-functional teams to identify and prioritize project requirementsImplement efficient algorithms and data structuresIntegrate front-end and back-end componentsTroubleshoot and resolve issuesOptimize code for performance and readabilityStay updated with industry trends and emerging technologie.Requirements:2+ years of experience in Python developmentFamiliarity with databases MySQL, PostgreSQL, MongoDB, etc.Knowledge of front-end technologies (HTML, CSS, JavaScript, etc.)Strong problem-solving skills and attention to detailExcellent communication and teamwork skills.If you're passionate about Python development and eager to join our innovative team, please submit your resume and cover letter tohira.hr@reactivespace.com"},
{"first_name": "Aqsa", "last_name": "Yaseen", "tagline": "Actively hiring | 13K+ Pool of Tech People| HR & Technical Recruiter | Connecting Top Tech Talent with Global Opportunities | Expert in Talent Acquisition & Behavioral Assessments | Open to Remote Roles in the US", "profile_url": "https://www.linkedin.com/in/aqsa-yaseen-62a889159?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACYJ-EIBJextNBzh9AGnkN_n-8sYUomvk7M", "job_link": null, "job_description": "Remote Job Opportunity!!Position: Backend Python/JavaScript DeveloperLocation: Remote (Contract)Job Type: Part-Time/Project BasedWe're looking for contract developers for our AI startup in the US, who are proficient with AWS Lambda and serverless architecture.Requirements: - Proven experience as a Backend Developer with expertise in Python and JavaScript.- Strong understanding of AWS services, particularly AWS Lambda and serverless architecture.Please share your resume at aqsayaseen91+linkedin@gmail.com or connect with me."},
{"first_name": "Ayesha", "last_name": "kanwal - CHRP", "tagline": "Human Resources Manager | Human Resources Recruiter | Headhunter | Talent Acquisition Specialist | Hiring | HR Executive", "profile_url": "https://www.linkedin.com/in/ayesha-kanwal-chrp-5b376421a?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAADdI-FcBLmDKKOBGtsKQeEtD2Dd5N7VPQBU", "job_link": null, "job_description": "📢Remote Hiring Alert 📢:Python Developer with VPN Experience (Remote)We are looking for a skilled Python Developer with expertise in VPN technologies to join our team remotely. The ideal candidate will be responsible for developing and optimizing secure, VPN-integrated applications.Key Responsibilities:- Develop and maintain Python applications.- Integrate and optimize VPN solutions.- Write efficient, scalable code.- Collaborate with teams to design and ship features.- Troubleshoot and upgrade existing systems.- Ensure data security via VPN protocols.Qualifications:- 2-3 years of Python development experience.- Proficient in VPN technologies (OpenVPN, IPSec, WireGuard).- Knowledge of networking protocols, cloud services (AWS, Azure), and version control (Git).- Strong problem-solving, communication, and teamwork skills.Preferred Skills:- Experience with DevOps, Linux/Unix systems, and scripting.How to Apply:Email your resume and cover letter to ayesha.kanwal1345@gmail.com or DM Mention job title in the subject line.hashtag#PythonDeveloper hashtag#RemoteWork hashtag#VPN hashtag#CyberSecurity hashtag#PythonJobs hashtag#WorkFromHome hashtag#TechJobs hashtag#RemoteJobs hashtag#SoftwareDevelopment"},
{"first_name": "Talha", "last_name": "Khan", "tagline": "Technical Recruiter@TEKHQS | HR Operations | Talent Management", "profile_url": "https://www.linkedin.com/in/talha-khan-33a300180?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACrCZd4BJrjwtzdOJaGkpVpYZptWv7RAu24", "job_link": null, "job_description": "🚀 We’re Hiring! 🚀hashtag#RemoteHiringExciting new opportunities are open, and we are looking for talented professionals to make a real impact with one of our clients! If you’re passionate, driven, and eager to excel, we want to hear from you. Our current roles include:1. Ruby Developer- Contract Role-100% Remote- World Wide2. JAVA Script/ TypeScript Engineer- Contract Role- 100% Remote- World Wide3. Python Developer- Contract Role- 100% Remote- World Wide4. PhD - Computer Science- Contract Role- 100% Remote- World WideNote: All positions are Remote (World Wide). If anyone is interested, please share your CV at anshika@cuttingedgesearch.com or WhatsApp on: +91-8864848644Relevant applicants will be contacted with the job description and further details.hashtag#RubyDeveloper hashtag#RubyOnRails hashtag#JavaScriptEngineer hashtag#TypeScript hashtag#PythonDeveloper hashtag#softwareengineer hashtag#backenddeveloper hashtag#PhDComputerScience hashtag#ResearchEngineer hashtag#remotejob hashtag#recruitment hashtag#hr"},
{"first_name": "Muhammad", "last_name": "Haroon", "tagline": "Remote Hirings in Brazil, Balkans & Pakistan | Talent Acquisiton Consultant", "profile_url": "https://www.linkedin.com/in/mirharoonofficial?miniProfileUrn=urn%3Ali%3Afsd_profile%3AACoAACC5brkBTBsqR2JhgSZRu4HIPTAxiSi9cmY", "job_link": null, "job_description": "Exciting Opportunity for Python Developers! 😀 We're on the lookout for talented Python Developers located in Pakistan and the Balkans to join our team and work remotely with a leading client based in North America.If you have the skills and are ready for a new challenge, check out the details in the attached file. Let's explore this opportunity together!Looking forward to connecting with you!Wishing you a fantastic weekend ahead! 😎 hashtag#python hashtag#django hashtag#flask hashtag#oddo hashtag#sql hashtag#pythondevelopers hashtag#hiringnow hashtag#applynow hashtag#jobs hashtag#career hashtag#remotejobs hashtag#remotecareer"}
]